**Load the CSV**

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
print(pd.__version__)

2.3.1

In [4]:
df = pd.read_csv('Walmart.csv', encoding='utf-8', encoding_errors='ignore')
df.shape

(10051, 11)

**Data Cleaning**

In [5]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [6]:
#we will clean the $ sign from unit price 
df['unit_price'] = df['unit_price'].str.replace('$','')

In [7]:
df['unit_price'].sort_values(ascending=False)

122     99.96
983     99.96
930     99.92
494     99.89
283     99.83
        ...
1918      NaN
1919      NaN
1920      NaN
1921      NaN
1922      NaN
Name: unit_price, Length: 10051, dtype: object

In [8]:
# We will see how many values of unit_price column are null
len(df[df['unit_price'].isnull()])

31

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [10]:
#We will change the type of the unit price from object to float
df['unit_price'] = df['unit_price'].astype(float)

In [11]:
df['unit_price'].dtype

dtype('float64')

In [12]:
df['Total_Amount'] = df['unit_price'] * df['quantity']

In [13]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Total_Amount
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [14]:
# We will see how many values of unit_price column are null
len(df[df['unit_price'].isnull()])

31

In [15]:
len(df[df['quantity'].isnull()])

31

In [16]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
Total_Amount      31
dtype: int64

In [17]:
#Now we will drop all the null values from unit_price, quantity and Amount
df.dropna(inplace=True)

In [18]:
#We will fnd how many duplicate values we have
df.duplicated().sum()

np.int64(51)

In [19]:
df.drop_duplicates(keep='first', inplace=True)

In [20]:
#We can see that the shape has changed
df.shape

(9969, 12)

In [21]:
#mysql
import pymysql
from sqlalchemy import create_engine

In [22]:
# mysql
# host = localhost
# port = 3306
# user = root

In [ ]:
#mysql connection

engine_mysql = create_engine("mysql+pymysql://root:**********@localhost:3306/walmartdb")

try:
	engine_mysql
	print("Connected successfully to MySQL")
except:
    print("Unable to connect")

Connected successfully to MySQL

In [27]:
df.to_sql(name='walmart', con=engine_mysql, if_exists='append', index=False)

9969